Autodesk.Revit.Utility.AssetSet
A set that contains assets.

Autodesk.Revit.Utility.AssetSet.Insert(Autodesk.Revit.Utility.Asset)
System.Int32
Insert the specified asset into the set.
item: The asset to be inserted into the set.
Returns: Returns whether the asset was inserted into the set.

Autodesk.Revit.Utility.AssetSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.Utility.AssetSet.ReverseIterator
Autodesk.Revit.Utility.AssetSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.Utility.AssetSet.ForwardIterator
Autodesk.Revit.Utility.AssetSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.Utility.AssetSet.Erase(Autodesk.Revit.Utility.Asset)
System.Int32
Removes a specified asset from the set.
item: The asset to be erased.
Returns: The number of assets that were erased from the set.

Autodesk.Revit.Utility.AssetSet.Contains(Autodesk.Revit.Utility.Asset)
System.Boolean
Tests for the existence of a asset within the set.
item: The asset to be searched for.
Returns: The Contains method returns True if the asset is within the set, otherwise False.

Autodesk.Revit.Utility.AssetSet.Clear
void
Removes every asset from the set, rendering it empty.

Autodesk.Revit.Utility.AssetSet.Size
System.Int32
get
Returns the number of assets that are in the set.

Autodesk.Revit.Utility.AssetSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.